<template>
	<div class="terms">
		<div class="terms_title">
			<h3 class="terms_type">이용약관</h3>
		</div>
		<!-- need to  <client-only></client-only>-->
		<div class="list">
			<div class="title">제 1 조 (목적)</div>
			<div class="desc">
				<div class="sub_title">
					이 약관은 “회원”이 “상품”에 관한 정보를 습득할 수 있도록 싸발적인
					스트릿패션(이하 "회사"라 합니다)가 운영, 제공하는 SNKRS98 서비스(이하
					"서비스")에 대한 것으로 본 약관에서는 “서비스”의 이용과 관련하여
					“회사”와 “회원”과의 권리, 의무 및 책임사항, 기타 필요한 사항을
					규정합니다.
				</div>
			</div>
		</div>
		<div class="list">
			<div class="title">제 2 조 (용어의 정의)</div>
			<div class="desc">
				<div class="sub_title">
					이 약관에서 사용하는 용어의 정의는 다음 각 호와 같으며, 정의되지 않은
					용어에 대한 해석은 관계 법령 및 지침, 본 이용약관, 개인정보취급방침,
					상관례 등에 의합니다.
				</div>
				<br />"서비스"라 함은 회사가 PC 및/또는 모바일 환경에서 제공하는 SNKRS98
				서비스 및 관련 제반 서비스를 말합니다.<br />
				"회원"이라 함은 “회사”의 "서비스"에 접속하여 이 약관에 따라 "회사"와
				이용계약을 체결하고 "회사"가 제공하는 "서비스"를 이용하는 고객을
				말합니다.<br />
				"드로우" 또는 “라플”이라 함은 "상품" 추첨에 응모하는 "행위"를
				말합니다.<br />
				"구매자" 또는 “구매회원”이라 함은 "서비스"에 등록된 재화 및
				용역(이하"상품")을 구매하거나 또는 구매할 의사로 서비스를 이용하는
				회원을 말합니다.<br />
				"판매자" 또는 “판매회원”이라 함은 "서비스"에 “상품”을 등록하여
				판매하거나 또는 제공할 의사로 서비스를 이용하는 회원을 말합니다.<br />
				"게시물"이라 함은 "회원"이 "서비스"를 이용함에 있어 "서비스"상에 게시한
				문자, 음성, 음향, 화상, 동영상 등의 정보 형태의 글(댓글 포함),
				사진(이미지), 동영상 및 각종 파일과 링크 등 일체를 의미합니다.<br />
				"회원정보"라 함은 “서비스”를 이용하는 고객이 등록한 정보를 말합니다.<br />
			</div>
		</div>
		<div class="list">
			<div class="title">제 3 조 (약관의 명시, 효력 및 변경)</div>
			<div class="desc">
				<div class="sub_title">
					1. "회사"는 이 약관의 내용을 "회원"이 쉽게 알 수 있도록 “서비스” 초기
					화면에 게시합니다.<br /><br />
					2. "회사"가 약관을 개정할 경우에는 적용일자 및 개정사유를 명시하여
					현행약관과 함께 제1항의 방식에 따라 그 개정약관의 적용일자 7일 전부터
					공지합니다. 다만, "회원"에게 불리한 내용으로 약관을 개정하는 경우에는
					그 적용일자 30일 전부터 공지 외에 "회원정보"에 등록된 이메일 등 전자적
					수단을 통해 별도로 명확히 통지하도록 합니다.<br /><br />
					3. "회사"가 전항에 따라 "회원"에게 통지하면서 공지 기간 이내에
					거부의사를 표시하지 않으면 승인한 것으로 본다는 뜻을 명확하게
					고지하였음에도 “회원”이 명시적으로 거부의사를 밝히지 않거나,
					"서비스"를 이용할 경우에는 "회원"이 개정약관에 동의한 것으로
					봅니다.<br /><br />
					4. "회원"이 개정약관에 동의하지 않는 경우 "회사"는 개정약관의 내용을
					적용할 수 없으며, 이 경우 회원은 제8조 제1항의 규정에 따라 이용계약을
					해지할 수 있습니다.<br />
				</div>
			</div>
		</div>
		<div class="list">
			<div class="title">제 4 조 (약관의 해석)</div>
			<div class="desc">
				<div class="sub_title"></div>
				"회사"는 개별 서비스에 대해서 별도의 이용약관 및 정책(이하 "개별 약관
				등")을 둘 수 있으며, 해당 내용이 이 약관과 상충할 경우에는 "개별 약관
				등"이 우선하여 적용됩니다.
			</div>
			이 약관에 명시되지 않은 사항은 '약관의 규제에 관한 법률'(이하 "약관법"),
			‘전자상거래 등에서의 소비자보호에 관한 법률’(이하 "전자상거래법"),
			‘정보통신망이용촉진및정보보호등에관한법률’(이하 “정보통신망법”),
			공정거래위원회가 정하는 전자상거래 등에서의 소비자보호지침(이하
			“소비자보호지침”) 및 관계 법령 또는 상관례에 따릅니다.
		</div>
		<div class="list">
			<div class="title">제 5 조 (이용계약의 체결)</div>
			<div class="desc">
				<div class="sub_title">
					1. 이용계약은 "회원"이 되고자 하는 자(이하 "가입신청자")가 약관의
					내용에 대하여 동의를 한 후 회원가입신청을 하고 "회사"가 이러한 신청에
					대하여 승낙함으로써 체결됩니다. "회사"는 "가입신청자"의 신청에 대하여
					서비스 이용을 승낙함을 원칙으로 합니다. 다만, "회사"는 다음 각 호에
					해당하는 신청에 대하여는 승낙을 하지 않거나, 사후에 이용계약을 해지할
					수 있습니다.<br /><br />
					가입신청자가 이 약관에 의하여 이전에 회원자격을 상실한 적이 있는
					경우<br />
					타인의 명의를 도용하여 이용신청을 하는 경우<br />
					허위의 정보를 기재하거나, 회사가 제시하는 내용을 기재하지 않은 경우<br />
					14세 미만 아동이 회원가입 시 법정대리인(부모 등)의 동의를 얻지 아니한
					경우<br />
					이용자의 귀책사유로 인하여 승인이 불가능하거나 기타 규정한 제반 사항을
					위반하며 신청하는 경우<br /><br />
					2. "회사"는 “서비스” 관련 설비의 여유가 없거나, 기술상 또는 업무상
					문제가 있는 경우에는 승낙을 유보할 수 있습니다.<br /><br />
					3. 회원가입신청의 승낙을 하지 아니하거나 유보한 경우, "회사"는
					원칙적으로 이를 "가입신청자"에게 알리도록 합니다.<br /><br />
					4. 이용계약의 성립 시기는 "회사"가 가입완료를 신청절차 상에서 표시한
					시점으로 합니다.<br /><br />
					5. "회사"는 "회원"에 대해 회사정책에 따라 등급별로 구분하여 이용시간,
					이용횟수, 서비스 메뉴 등을 세분하여 이용에 차등을 둘 수 있습니다.
				</div>
			</div>
		</div>
		<div class="list">
			<div class="title">
				제 6 조 ("회원"의 "아이디" 및 "비밀번호"의 관리에 대한 의무)
			</div>
			<div class="desc">
				<div class="sub_title">
					1. "회원"의 "아이디"와 "비밀번호"에 관한 관리책임은 "회원"에게 있으며,
					이를 제3자가 이용하도록 하여서는 안 됩니다.<br /><br />
					2. "회사"는 "회원"의 "아이디"가 개인정보 유출 우려가 있거나, 회사 및
					회사의 운영자로 오인한 우려가 있는 경우 등 “회원” 및 “서비스” 보호에
					필요한 경우 해당 "아이디"의 이용을 제한할 수 있습니다.<br /><br />
					3. "회원"은 "아이디"및 "비밀번호"가 도용되거나 제3자가 사용하고 있음을
					인지한 경우에는 이를 즉시 "회사"에 통지하고 "회사"의 안내에 따라야
					합니다.<br /><br />
					4. 제3항의 경우에 해당 "회원"이 "회사"에 그 사실을 통지하지 않거나,
					통지한 경우에도 "회사"의 안내에 따르지 않아 발생한 불이익에 대하여
					"회사"는 책임지지 않습니다.
				</div>
			</div>
		</div>
		<div class="list">
			<div class="title">제 7 조 (이용제한 등)</div>
			<div class="desc">
				<div class="sub_title">
					1. "회사"는 "회원"이 이 약관의 의무를 위반하거나 "서비스"의 정상적인
					운영을 방해한 경우, 경고, 일시정지, 영구이용정지 등으로 "서비스"
					이용을 단계적으로 제한할 수 있습니다.<br /><br />
					2. "회사"는 전항에도 불구하고, “회원”의 의무 위반 행위나 “서비스” 운영
					방해 행위에 대하여 사안의 중대성이나 긴급성 등을 토대로 “서비스”에
					미치는 영향을 고려하여 경고 등의 단계적인 조치를 거치지 않고 곧바로
					일시 정지나 영구이용정지를 할 수 있습니다.<br /><br />
					특히, ‘주민등록법'을 위반한 명의도용 및 결제도용, '저작권법'을 위반한
					불법프로그램의 제공 및 운영방해, "정보통신망법"을 위반한 불법통신 및
					해킹, 악성프로그램의 배포, 접속권한 초과행위 등과 같이 관련법을
					위반하여 서비스에 중대한 영향을 끼친 경우에는 즉시 영구이용정지를 할
					수 있으며, 영구이용정지를 할 수 있는 위반행위는 이에 제한되지
					않습니다. 본 항에 따른 영구이용정지 시 "서비스" 이용을 통해 획득한
					"포인트" 및 기타 혜택 등도 모두 소멸되며, "회사"는 이에 대해 별도로
					보상하지 않습니다.<br /><br />
					3. "회사"는 본 조의 이용제한 범위 내에서 제한의 조건 및 세부내용은 본
					약관 또는 운영 정책 및 개별 서비스 상의 이용약관이나 운영정책에서
					정하는 바에 의합니다.<br /><br />
					4. "회원"은 본 조에 따른 이용제한 등에 대해 "회사"가 정한 절차에 따라
					이의신청을 할 수 있습니다. 이 때 이의가 정당하다고 "회사"가 인정하는
					경우 "회사"는 즉시 "서비스"의 이용을 재개합니다.
				</div>
			</div>
		</div>
		<div class="list">
			<div class="title">제 8 조 (계약해제, 해지 등)</div>
			<div class="desc">
				<div class="sub_title">
					1. "회원"은 언제든지 고객센터 또는 내 정보 관리 메뉴 등을 통하여
					이용계약 해지 신청을 할 수 있으며, "회사"는 관련법 등이 정하는 바에
					따라 이를 즉시 처리 합니다. 다만, “회사”와 “회원” 사이에 분쟁 계속
					중인 경우 등과 같이 이용계약을 해지하는 것이 적절하지 않은 경우에는
					해지 처리가 제한될 수 있습니다.<br /><br />
					2. "회원"이 계약을 해지할 경우, 관련법 및 개인정보취급방침에 따라
					"회사"가 회원정보를 보유하는 경우를 제외하고는 해지 즉시 "회원"의 모든
					데이터는 소멸됩니다.<br /><br />
				</div>
			</div>
		</div>
		<div class="list">
			<div class="title">제 9 조 ("서비스"의 이용)</div>
			<div class="desc">
				<div class="sub_title">
					1. "회사"는 컴퓨터 등 정보통신설비의 보수점검, 교체 및 고장, 통신두절
					또는 운영상 상당한 이유가 있는 경우 "서비스"의 제공을 일시적으로
					중단할 수 있습니다. 이 경우 "회사"는 제20조에 정한 방법으로 "회원"에게
					통지합니다. 다만, "회사"가 사전에 통지할 수 없는 부득이한 사유가 있는
					경우 사후에 통지할 수 있습니다.<br /><br />
					2. "회사"는 서비스의 제공에 필요한 경우 정기점검을 실시할 수 있으며,
					정기점검시간은 서비스제공화면 등에 공지한 바에 따릅니다.
				</div>
			</div>
		</div>
		<div class="list">
			<div class="title">제 10 조 ("서비스"의 내용)</div>
			<div class="desc">
				<div class="sub_title">
					1. 정보 서비스<br />
					“회사”가 각 “회원”에 대한 응모정보, 회원정보 등 “회원”의 활동 기록을
					모아 “회원” 응모 서비스를 신속하고 편리하게 이용하도록 하기 위하여
					제공하는 서비스를 말합니다.<br /><br />
					2. 기타 정보 서비스<br />
					“상품” 서비스 이외에 “회사”가 제공하는 서비스를 통하여 “회원”에게
					온라인으로 제공하는 정보서비스, 커뮤니티 등의 인터넷 서비스를
					말합니다.
				</div>
			</div>
		</div>
		<div class="list">
			<div class="title">제 11 조 ("서비스"의 변경 및 중지)</div>
			<div class="desc">
				<div class="sub_title">
					1. "회사"는 상당한 이유가 있는 경우에 운영상, 기술상의 필요에 따라
					제공하고 있는 전부 또는 일부 "서비스"를 제한, 변경하거나 중지할 수
					있습니다.<br /><br />
					2. "회사"는 제1항에 의한 서비스 중단의 경우에 인터넷 등에 사전
					공지하거나 제20조("회원"에 대한 통지)에 정한 방법으로 "회원"에게
					통지합니다.<br /><br />
					3. "서비스"의 내용, 이용방법, 이용시간에 대하여 변경이 있는 경우에는
					변경사유, 변경될 “서비스”의 내용 및 제공일자 등은 그 변경 전에 해당
					“서비스” 초기화면에 게시 합니다.<br /><br />
					4. "회사"는 무료로 제공되는 “서비스”의 일부 또는 전부를 “회사”의 정책
					및 운영의 필요상 수정, 중단, 변경할 수 있으며, 이에 대하여 관련법에
					특별한 규정이 없는 한 "회원"에게 별도의 보상을 하지 않습니다.
				</div>
			</div>
		</div>
		<div class="list">
			<div class="title">제 12 조 ("게시물"의 저작권)</div>
			<div class="desc">
				<div class="sub_title">
					1. "회원"은 저작권 관련 규정을 준수하기 위해 충분한 주의를 기울여야만
					합니다. 만약 “회원”이 등록한 게시물이 제 3자의 저작권을 침해한 경우,
					민형사상 모든 책임은 “회원” 당사자에게 있으며, 이와 관련해서 회사는
					어떠한 책임도 지지 않습니다.<br /><br />
					2. “회원”는 "서비스"를 이용함으로써 얻은 정보 중 "회사"에게
					지적재산권이 귀속된 정보를 "회사"의 사전 승낙 없이 복제, 송신, 출판,
					배포, 방송 기타 방법에 의하여 영리목적으로 이용하거나 제 3자에게
					이용하게 하여서는 안됩니다.<br /><br />
					3. "회사"는 "회원"이 작성한 각종 게시물을 판촉, 홍보 등의 목적으로
					“서비스”에서 사용하는 것 외에도 “서비스” 제공에 필요한 범위에서 타
					사이트에 복제, 배포, 전송, 전시할 수 있으며, 본질적인 내용에 변경을
					가하지 않는 범위 내에서 수정, 편집될 수 있습니다.<br /><br />
					4. "회원"이 공개한 "게시물"은 "서비스"를 통해 전체 “회원”, 관련 제반
					서비스에 공유될 수 있으며, “회사”는 해당 “게시물”을 “서비스”의 홍보,
					안내 등의 목적으로 사용할 수 있습니다.<br /><br />
					5. "회사"가 작성한 저작물에 대한 저작권 및 기타 지적 재산권은 "회사"에
					귀속합니다.
				</div>
			</div>
		</div>
		<div class="list">
			<div class="title">제 13 조 ("게시물"의 관리)</div>
			<div class="desc">
				<div class="sub_title">
					1. 자동화된 수단을 활용하는 등 서비스의 기능을 비정상적으로 이용하여
					게재된 게시물, 서비스의 제공 취지와 부합하지 않는 내용의 게시물은 다른
					이용자들의 정상적인 서비스 이용에 불편을 초래하고 더 나아가 서비스의
					원활한 제공을 방해하므로 역시 제한될 수 있습니다. 이용 제한의 대상이
					될 수 있는 부적절한 게시물에 대한 상세한 내용은 본 약관 제24조의 규정
					및 정보통신에 관한 심의 규정, 기타 운영 정책 등을 참고해 주시기
					바랍니다.<br /><br />
					2. "회원"은 자신의 "게시물"이 타인의 저작권이나 명예 등 제3자의 권리를
					침해하지 않도록 주의하여야 합니다. “회사”는 이에 대한 문제를 해결하기
					위해 "정보통신망법" 또는 "저작권법" 등을 근거로 권리 침해 주장자의
					요청에 따른 게시물 게시중단, 원 게시자의 이의신청에 따른 해당 게시물
					게시 재개 등을 내용으로 하는 게시중단요청 서비스를 운영하고 있습니다.
					타인의 “게시물”로 인해 자신의 저작권이나 명예가 침해되었다고 생각하는
					“회원”은 게시중단요청 서비스를 통해 해당 “게시글”의 게시중단 요청을 할
					수 있습니다.<br /><br />
					3. "회사"는 전항에 따른 권리자의 요청이 없는 경우라도 "전자상거래법",
					“정보통신망법”, “저작권법”, “정보통신에 관한 심의 규정”등 권리침해가
					인정될 만한 사유가 있거나 기타 “회사” 정책 및 관련법에 위반되는
					경우에는 관련법에 따라 해당 "게시물"에 대해 임시조치 등을 취할 수
					있습니다.<br /><br />
					4. 본 조에 따른 세부절차는 "정보통신망법" 및 "저작권법"이 규정한 범위
					내에서 "회사"가 정한 "게시중단요청서비스"에 따르며, 부적절한 게시글을
					게시한 “회원”에 대해서는 제7조 및 운영정책 등에서 정한 바에 따라
					이용제한 조치를 취할 수 있습니다.
				</div>
			</div>
		</div>
		<div class="list">
			<div class="title">제 14 조 (권리의 귀속)</div>
			<div class="desc">
				<div class="sub_title">
					1. "서비스"에 대한 저작권 및 지적재산권은 "회사"에 귀속됩니다. 단,
					"회원"의 "게시물" 및 제휴계약에 따라 제공된 저작물 등은 제외합니다.<br /><br />
					2. "회사"는 서비스와 관련하여 "회원"에게 "회사"가 정한 이용조건에 따라
					계정, "아이디", "포인트" 등을 이용할 수 있는 이용권한만을 부여하며,
					"회원"은 이에 대한 양도, 판매, 담보제공 등의 처분행위를 할 수
					없습니다.<br /><br />
					3. “회사”가 "서비스"를 제공함에 사용되는 보안 기술이나 소프트웨어에
					대해 “회원”은 회피 또는 변경하려 시도를 하여서는 안되며, “서비스” 및
					이에 필요한 기술 또는 소프트웨어를 부정 사용 및 타인이 그렇게 하는
					것을 조장하는 행위 등은 금지되어 있습니다. 만약 "회원"이 그와 같은
					행위를 하는 경우 이에 대한 모든 책임은 "회원" 본인에게 있습니다.
				</div>
			</div>
		</div>
		<div class="list">
			<div class="title">제 15 조 ("회사"의 의무)</div>
			<div class="desc">
				<div class="sub_title">
					1. "회사"는 관련법령 및 이 약관 등에서 금지한 행위를 하지 않으며,
					계속적이고 안정적으로 "서비스"를 제공하기 위하여 최선을 다하여
					노력합니다.<br /><br />
					2. "회사"는 "회원"이 안전하게 "서비스"를 이용할 수 있도록
					개인정보(신용정보 포함)보호를 위해 보안시스템을 갖추어야 하며
					개인정보보호정책을 공시하고 준수합니다.<br /><br />
					3. "회사"는 서비스 이용과 관련하여 "회원"으로부터 제기된 의견이나
					불만이 정당하다고 인정할 경우에는 이를 처리하여야 합니다. “회원”이
					제기한 의견이나 불만사항에 대해서는 게시판을 활용하거나 전자우편 등을
					통하여 "회원"에게 처리과정 및 결과를 전달합니다.
				</div>
			</div>
		</div>
		<div class="list">
			<div class="title">제 16 조 (개인정보보호 의무)</div>
			<div class="desc">
				<div class="sub_title">
					"회사"는 이용계약 체결 과정에서 가입신청자의 이메일 주소 등의 정보를
					수집할 수 있으며, “회사”는 "개인정보보호법” 등 관계 법령이 정하는 바에
					따라 "회원"의 "개인정보"를 보호하기 위해 노력합니다. "개인정보"의 보호
					및 사용에 대해서는 관련법 및 "회사"의 개인정보보호정책이 적용됩니다.
				</div>
			</div>
		</div>
		<div class="list">
			<div class="title">제 17 조 ("회원"에 대한 통지)</div>
			<div class="desc">
				<div class="sub_title">
					1. "회사"가 "회원"에 대한 통지를 하는 경우 이 약관에 별도 규정이 없는
					한 "회원"이 지정한 전자우편주소, 서비스 내 전자메모 및 쪽지 등으로 할
					수 있습니다.<br /><br />
					2. "회사"는 "회원" 전체에 대한 통지의 경우 7일 이상 "회사"의 게시판에
					게시함으로써 제1항의 통지에 갈음할 수 있습니다.
				</div>
			</div>
		</div>
		<div class="list">
			<div class="title">제 18 조 (부적절 행위)</div>
			<div class="desc">
				<div class="sub_title">
					1. "회사"는 본 약관에서 명시한 사항들과 관련법령 및 상거래의 일반
					원칙을 위반하는 부적절 행위를 행한 “회원”에게 “서비스”의 이용에 대한
					제재를 가할 수 있으며, 필요한 경우 관련 법령에 따라 민형사상의 책임
					물을 수 있으니 “서비스” 이용에 주의 부탁드립니다.<br /><br />
					2. "회원"이 다음의 사유에 해당하는 부적절 행위를 한 경우 "회사"는 사전
					통보없이 해당 "회원" 이 등록한 내용을 삭제조치하고 "회원"의 “서비스”
					이용을 제한하거나 “회원” 자격을 상실시킬 수 있습니다.<br /><br />
					타인의 정보도용<br />
					“서비스”에서 예정하고 있거나 “회사”가 허락한 범위를 벗어나 영리를
					목적으로 서비스를 사용하는 행위<br />
					"서비스"에 허위정보 등록<br />
					과대, 과장 광고 (스팸성 홍보글, 도배행위 등)<br />
					"회사"의 승인을 구하지 않은 상업성 광고 (개인사업자, 법인의
					자사홍보등)<br />
					대가를 받고 게시물을 작성하였음에도 이러한 사실을 추천・보증 등에 관한
					심사지침에서 정한 방식에 따라 밝히지 않은 게시물<br />
					시스템의 오류를 회사에 알리지않고 해당 오류를 이용해 이득을 취하는
					행위(동일 전화번호로 인증을 반복하여 포인트를 취하는 행위 등)<br />
					타인의 전화번호 또는 이메일을 도용하거나 허위로 이메일을 기재하여
					이득을 취하는 행위<br />
					"회사"가 정한 정보 이외의 정보(컴퓨터 프로그램 등) 등의 송신 또는
					게시<br />
					"회사"가 제공하는 "서비스" 내용의 크롤링,스크래핑 혹은 프로그램을 통한
					데이터를 수집하는 행위<br />
					기타 관련법령, 본 약관의 규정, 이용안내 및 "서비스"와 관련하여 공지한
					주의사항, "회사"가 통지하는 사항을 위반한 행위<br />
					“회사”의 업무에 방해되거나 기타 "회사"가 필요하다고 판단하는 경우
				</div>
			</div>
		</div>
		<div class="list">
			<div class="title">제 19 조 (기타)</div>
			<div class="desc">
				<div class="sub_title">
					1. 본 약관에 대해서는 대한민국법을 준거법으로 하고, 대한민국 법원이
					관할권을 갖는 것으로 합니다.<br /><br />
					2. “회사”와 “회원” 간 발생한 분쟁에 관한 소송은 제소 당시의 “회원”의
					주소에 의하고, 주소가 없는 경우 거소를 관할하는 지방법원의 전속관할로
					합니다. 단, 제소 당시 “회원”의 주소 또는 거소가 명확하지 아니한 경우의
					관할법원은 민사소송법에 따라 정합니다. 해외에 주소나 거소가 있는
					고객의 경우 “회사”와 “회원”간 발생한 분쟁에 관한 소송은 대한민국
					서울중앙지방법원을 관할 법원으로 합니다.
				</div>
			</div>
		</div>
		<div class="list">
			<div class="sub_title">2021년 1월 28일 공고<br />2021년 2월 1일 시행</div>
		</div>
	</div>
</template>

<script>
export default {
	beforeRouteEnter(to, from, next) {
		next(vm => {
			vm.$store.state.history = from.path;
			vm.prevRoute = from;
		});
	},
	created() {
		const layout = {
			hasHeader: false, // Header 여부
			hasNav: false, // Nav(발매정보 / 타임라인) 여부
			hasNavAction: true, // Header 타입
			navTransParent: false, // 투명도 설정
			hasFooter: false, // Footer 여부
			title: '서비스 이용약관',
		};
		this.$store.state.layout = layout;
	},
};
</script>

<style scoped>
.terms {
	margin-top: 64px;
	padding: 20px;
}
.terms_type {
	font-size: 24px;
	font-weight: bold;
}
.terms_title {
	padding-bottom: 16px;
	border-bottom: 2px solid #222;
}
.list {
	color: #222;
	margin: 16px 0 0;
	padding: 0 0 10px;
}
.list .title {
	color: #222;
	font-size: 15px;
	font-weight: 700;
	margin: 16px 0 0;
}
.list .sub_title {
	color: #222;
	margin: 16px 0 0;
	padding: 0 0 10px;
	font-size: 0.9rem;
}
.list .desc {
	color: #222;
	padding: 3px 0 4px;
	font-size: 0.9rem;
}
.list .sub_desc {
	color: #444;
	padding-top: 2px;
	font-size: 0.9rem;
}
</style>
